{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"name":"WikidataMeSH.ipynb","provenance":[],"collapsed_sections":[],"authorship_tag":"ABX9TyONRDmYkIEysv5H1Cw7HZlw"},"kernelspec":{"name":"python3","display_name":"Python 3"}},"cells":[{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"c09hsK0hMDLx","executionInfo":{"status":"ok","timestamp":1611040499021,"user_tz":-540,"elapsed":6150,"user":{"displayName":"建石由佳","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GhbS5w63K0oL91tllVTu4w7Px6F6mTiiHklpcTg=s64","userId":"16832389303169777898"}},"outputId":"f8507334-e3fb-4362-cbb4-d36c69730a5f"},"source":["!pip install SPARQLWrapper "],"execution_count":3,"outputs":[{"output_type":"stream","text":["Collecting SPARQLWrapper\n","  Downloading https://files.pythonhosted.org/packages/00/9b/443fbe06996c080ee9c1f01b04e2f683b2b07e149905f33a2397ee3b80a2/SPARQLWrapper-1.8.5-py3-none-any.whl\n","Collecting rdflib>=4.0\n","\u001b[?25l  Downloading https://files.pythonhosted.org/packages/d0/6b/6454aa1db753c0f8bc265a5bd5c10b5721a4bb24160fb4faf758cf6be8a1/rdflib-5.0.0-py3-none-any.whl (231kB)\n","\u001b[K     |████████████████████████████████| 235kB 6.4MB/s \n","\u001b[?25hRequirement already satisfied: pyparsing in /usr/local/lib/python3.6/dist-packages (from rdflib>=4.0->SPARQLWrapper) (2.4.7)\n","Requirement already satisfied: six in /usr/local/lib/python3.6/dist-packages (from rdflib>=4.0->SPARQLWrapper) (1.15.0)\n","Collecting isodate\n","\u001b[?25l  Downloading https://files.pythonhosted.org/packages/9b/9f/b36f7774ff5ea8e428fdcfc4bb332c39ee5b9362ddd3d40d9516a55221b2/isodate-0.6.0-py2.py3-none-any.whl (45kB)\n","\u001b[K     |████████████████████████████████| 51kB 4.1MB/s \n","\u001b[?25hInstalling collected packages: isodate, rdflib, SPARQLWrapper\n","Successfully installed SPARQLWrapper-1.8.5 isodate-0.6.0 rdflib-5.0.0\n"],"name":"stdout"}]},{"cell_type":"code","metadata":{"id":"E8UpU2L6MtRX","executionInfo":{"status":"ok","timestamp":1611040501525,"user_tz":-540,"elapsed":601,"user":{"displayName":"建石由佳","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GhbS5w63K0oL91tllVTu4w7Px6F6mTiiHklpcTg=s64","userId":"16832389303169777898"}}},"source":["import sys\r\n","import os\r\n","from SPARQLWrapper import SPARQLWrapper\r\n","import rdflib\r\n","import json\r\n","import csv\r\n","import re"],"execution_count":4,"outputs":[]},{"cell_type":"code","metadata":{"id":"4BzLn27QM3gy","executionInfo":{"status":"ok","timestamp":1611040508174,"user_tz":-540,"elapsed":568,"user":{"displayName":"建石由佳","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GhbS5w63K0oL91tllVTu4w7Px6F6mTiiHklpcTg=s64","userId":"16832389303169777898"}}},"source":["# SPARQL prefixes for Wikidata\r\n","prefix_list=\"\"\"\r\n"," PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\r\n"," PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\r\n"," PREFIX ontolex: <http://www.w3.org/ns/lemon/ontolex#>\r\n"," PREFIX dct: <http://purl.org/dc/terms/>\r\n"," PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\r\n"," PREFIX owl: <http://www.w3.org/2002/07/owl#>\r\n"," PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\r\n"," PREFIX schema: <http://schema.org/>\r\n"," PREFIX cc: <http://creativecommons.org/ns#>\r\n"," PREFIX geo: <http://www.opengis.net/ont/geosparql#>\r\n"," PREFIX prov: <http://www.w3.org/ns/prov#>\r\n"," PREFIX wikibase: <http://wikiba.se/ontology#>\r\n"," PREFIX wdata: <http://www.wikidata.org/wiki/Special:EntityData/>\r\n"," PREFIX bd: <http://www.bigdata.com/rdf#>\r\n"," \r\n"," PREFIX wd: <http://www.wikidata.org/entity/>\r\n"," PREFIX wdt: <http://www.wikidata.org/prop/direct/>\r\n"," PREFIX wdtn: <http://www.wikidata.org/prop/direct-normalized/>\r\n"," \r\n"," PREFIX wds: <http://www.wikidata.org/entity/statement/>\r\n"," PREFIX p: <http://www.wikidata.org/prop/>\r\n"," PREFIX wdref: <http://www.wikidata.org/reference/>\r\n"," PREFIX wdv: <http://www.wikidata.org/value/>\r\n"," PREFIX ps: <http://www.wikidata.org/prop/statement/>\r\n"," PREFIX psv: <http://www.wikidata.org/prop/statement/value/>\r\n"," PREFIX psn: <http://www.wikidata.org/prop/statement/value-normalized/>\r\n"," PREFIX pq: <http://www.wikidata.org/prop/qualifier/>\r\n"," PREFIX pqv: <http://www.wikidata.org/prop/qualifier/value/>\r\n"," PREFIX pqn: <http://www.wikidata.org/prop/qualifier/value-normalized/>\r\n"," PREFIX pr: <http://www.wikidata.org/prop/reference/>\r\n"," PREFIX prv: <http://www.wikidata.org/prop/reference/value/>\r\n"," PREFIX prn: <http://www.wikidata.org/prop/reference/value-normalized/>\r\n"," PREFIX wdno: <http://www.wikidata.org/prop/novalue/>\r\n","\r\n"," PREFIX hint: <http://www.bigdata.com/queryHints#>\r\n"," \"\"\""],"execution_count":5,"outputs":[]},{"cell_type":"markdown","metadata":{"id":"2IT30H70OZIs"},"source":["# Extract Wikidata ID-MeSHID-English-Japanese"]},{"cell_type":"code","metadata":{"id":"g1fpCF-fPATE","executionInfo":{"status":"ok","timestamp":1611040514936,"user_tz":-540,"elapsed":675,"user":{"displayName":"建石由佳","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GhbS5w63K0oL91tllVTu4w7Px6F6mTiiHklpcTg=s64","userId":"16832389303169777898"}}},"source":["query_mesh_j_e=\"\"\"\r\n","select distinct ?wikidata_id ?mesh_id ?english  ?japanese\r\n","where {\r\n","  ?wikidata_id rdfs:label ?english ;\r\n","     rdfs:label ?japanese ;\r\n","     wdt:P486 ?mesh_id.\r\n","   Filter(lang(?english)=\"en\")\r\n","   Filter(lang(?japanese)=\"ja\")\r\n","   \r\n"," \r\n","} \r\n","\"\"\""],"execution_count":6,"outputs":[]},{"cell_type":"code","metadata":{"id":"6qL915e3PN4Q","executionInfo":{"status":"ok","timestamp":1611040517094,"user_tz":-540,"elapsed":767,"user":{"displayName":"建石由佳","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GhbS5w63K0oL91tllVTu4w7Px6F6mTiiHklpcTg=s64","userId":"16832389303169777898"}}},"source":["sparql_dbpedia = SPARQLWrapper(endpoint='https://query.wikidata.org/bigdata/namespace/wdq/sparql', returnFormat='json')"],"execution_count":7,"outputs":[]},{"cell_type":"code","metadata":{"id":"k9x-wETFPaDe","executionInfo":{"status":"ok","timestamp":1611040530918,"user_tz":-540,"elapsed":13437,"user":{"displayName":"建石由佳","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GhbS5w63K0oL91tllVTu4w7Px6F6mTiiHklpcTg=s64","userId":"16832389303169777898"}}},"source":["sparql_dbpedia.setQuery(prefix_list+query_mesh_j_e)\r\n","results1 = sparql_dbpedia.query().convert()"],"execution_count":8,"outputs":[]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"72McqpV4Pma2","executionInfo":{"status":"ok","timestamp":1611040538195,"user_tz":-540,"elapsed":1029,"user":{"displayName":"建石由佳","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GhbS5w63K0oL91tllVTu4w7Px6F6mTiiHklpcTg=s64","userId":"16832389303169777898"}},"outputId":"358507d6-322e-4007-81bf-86fe0a4c56e7"},"source":["results1['results']['bindings'][:10]"],"execution_count":9,"outputs":[{"output_type":"execute_result","data":{"text/plain":["[{'english': {'type': 'literal', 'value': 'Belgium', 'xml:lang': 'en'},\n","  'japanese': {'type': 'literal', 'value': 'ベルギー', 'xml:lang': 'ja'},\n","  'mesh_id': {'type': 'literal', 'value': 'D001530'},\n","  'wikidata_id': {'type': 'uri',\n","   'value': 'http://www.wikidata.org/entity/Q31'}},\n"," {'english': {'type': 'literal', 'value': 'happiness', 'xml:lang': 'en'},\n","  'japanese': {'type': 'literal', 'value': '幸福', 'xml:lang': 'ja'},\n","  'mesh_id': {'type': 'literal', 'value': 'D006240'},\n","  'wikidata_id': {'type': 'uri',\n","   'value': 'http://www.wikidata.org/entity/Q8'}},\n"," {'english': {'type': 'literal', 'value': 'broad bean', 'xml:lang': 'en'},\n","  'japanese': {'type': 'literal', 'value': 'ソラマメ', 'xml:lang': 'ja'},\n","  'mesh_id': {'type': 'literal', 'value': 'D031307'},\n","  'wikidata_id': {'type': 'uri',\n","   'value': 'http://www.wikidata.org/entity/Q131342'}},\n"," {'english': {'type': 'literal', 'value': 'Ulmaceae', 'xml:lang': 'en'},\n","  'japanese': {'type': 'literal', 'value': 'ニレ科', 'xml:lang': 'ja'},\n","  'mesh_id': {'type': 'literal', 'value': 'D034401'},\n","  'wikidata_id': {'type': 'uri',\n","   'value': 'http://www.wikidata.org/entity/Q156311'}},\n"," {'english': {'type': 'literal', 'value': 'Proteaceae', 'xml:lang': 'en'},\n","  'japanese': {'type': 'literal', 'value': 'ヤマモガシ科', 'xml:lang': 'ja'},\n","  'mesh_id': {'type': 'literal', 'value': 'D039105'},\n","  'wikidata_id': {'type': 'uri',\n","   'value': 'http://www.wikidata.org/entity/Q157228'}},\n"," {'english': {'type': 'literal', 'value': '18th century', 'xml:lang': 'en'},\n","  'japanese': {'type': 'literal', 'value': '18世紀', 'xml:lang': 'ja'},\n","  'mesh_id': {'type': 'literal', 'value': 'D049671'},\n","  'wikidata_id': {'type': 'uri',\n","   'value': 'http://www.wikidata.org/entity/Q7015'}},\n"," {'english': {'type': 'literal', 'value': 'X chromosome', 'xml:lang': 'en'},\n","  'japanese': {'type': 'literal', 'value': 'X染色体', 'xml:lang': 'ja'},\n","  'mesh_id': {'type': 'literal', 'value': 'D014960'},\n","  'wikidata_id': {'type': 'uri',\n","   'value': 'http://www.wikidata.org/entity/Q61333'}},\n"," {'english': {'type': 'literal', 'value': 'fatty acid', 'xml:lang': 'en'},\n","  'japanese': {'type': 'literal', 'value': '脂肪酸', 'xml:lang': 'ja'},\n","  'mesh_id': {'type': 'literal', 'value': 'D005227'},\n","  'wikidata_id': {'type': 'uri',\n","   'value': 'http://www.wikidata.org/entity/Q61476'}},\n"," {'english': {'type': 'literal', 'value': 'child mortality', 'xml:lang': 'en'},\n","  'japanese': {'type': 'literal', 'value': '乳幼児死亡率', 'xml:lang': 'ja'},\n","  'mesh_id': {'type': 'literal', 'value': 'D046688'},\n","  'wikidata_id': {'type': 'uri',\n","   'value': 'http://www.wikidata.org/entity/Q61559'}},\n"," {'english': {'type': 'literal',\n","   'value': 'management information system',\n","   'xml:lang': 'en'},\n","  'japanese': {'type': 'literal', 'value': '経営情報システム', 'xml:lang': 'ja'},\n","  'mesh_id': {'type': 'literal', 'value': 'D008331'},\n","  'wikidata_id': {'type': 'uri',\n","   'value': 'http://www.wikidata.org/entity/Q61905'}}]"]},"metadata":{"tags":[]},"execution_count":9}]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"-lSTsP1hRHXC","executionInfo":{"status":"ok","timestamp":1611019907966,"user_tz":-540,"elapsed":771,"user":{"displayName":"建石由佳","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GhbS5w63K0oL91tllVTu4w7Px6F6mTiiHklpcTg=s64","userId":"16832389303169777898"}},"outputId":"44236e42-bea4-4e53-cd17-c14b9d699e30"},"source":["len(results1['results']['bindings'])"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/plain":["15230"]},"metadata":{"tags":[]},"execution_count":10}]},{"cell_type":"markdown","metadata":{"id":"23yU2J3PQs8e"},"source":["# Todo:\r\n","* add aliases (skos:altLabel)\r\n","* extract COVID-related entries"]},{"cell_type":"code","metadata":{"id":"oEfAeTD0fTjO","executionInfo":{"status":"ok","timestamp":1611040735317,"user_tz":-540,"elapsed":553,"user":{"displayName":"建石由佳","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GhbS5w63K0oL91tllVTu4w7Px6F6mTiiHklpcTg=s64","userId":"16832389303169777898"}}},"source":["# Aliases (Japanese)\r\n","query_mesh_j_alias=\"\"\"\r\n","select distinct ?wikidata_id ?mesh_id ?japanese \r\n","where {\r\n","\r\n","  {?wikidata_id rdfs:label ?japanese} union {?wikidata_id skos:altLabel ?japanese}\r\n","  ?wikidata_id   wdt:P486 ?mesh_id.\r\n","\r\n","   Filter(lang(?japanese)=\"ja\")\r\n","   \r\n"," \r\n","} \r\n","\"\"\""],"execution_count":10,"outputs":[]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"zPjFQvyufiKY","executionInfo":{"status":"ok","timestamp":1611040756025,"user_tz":-540,"elapsed":12730,"user":{"displayName":"建石由佳","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GhbS5w63K0oL91tllVTu4w7Px6F6mTiiHklpcTg=s64","userId":"16832389303169777898"}},"outputId":"e7b55742-b760-4938-f472-eab11da0959d"},"source":["sparql_dbpedia.setQuery(prefix_list+query_mesh_j_alias)\r\n","results2 = sparql_dbpedia.query().convert()\r\n","len(results2['results']['bindings'])"],"execution_count":11,"outputs":[{"output_type":"execute_result","data":{"text/plain":["28667"]},"metadata":{"tags":[]},"execution_count":11}]},{"cell_type":"code","metadata":{"id":"uiE2-WTNftqf","executionInfo":{"status":"ok","timestamp":1611040795895,"user_tz":-540,"elapsed":492,"user":{"displayName":"建石由佳","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GhbS5w63K0oL91tllVTu4w7Px6F6mTiiHklpcTg=s64","userId":"16832389303169777898"}}},"source":["# Aliases (English)\r\n","query_mesh_e_alias=\"\"\"\r\n","select distinct ?wikidata_id ?mesh_id ?english\r\n","where {\r\n","\r\n","  {?wikidata_id rdfs:label ?english} union {?wikidata_id skos:altLabel ?english}\r\n","  ?wikidata_id   wdt:P486 ?mesh_id.\r\n","\r\n","   Filter(lang(?english)=\"en\")\r\n","   \r\n"," \r\n","} \r\n","\"\"\""],"execution_count":12,"outputs":[]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"TFiKBeizg6rA","executionInfo":{"status":"ok","timestamp":1611040833026,"user_tz":-540,"elapsed":15692,"user":{"displayName":"建石由佳","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GhbS5w63K0oL91tllVTu4w7Px6F6mTiiHklpcTg=s64","userId":"16832389303169777898"}},"outputId":"9b1b39ef-95ff-45a0-f84a-a0121f3f16f6"},"source":["sparql_dbpedia.setQuery(prefix_list+query_mesh_e_alias)\r\n","results3 = sparql_dbpedia.query().convert()\r\n","len(results3['results']['bindings'])"],"execution_count":13,"outputs":[{"output_type":"execute_result","data":{"text/plain":["146247"]},"metadata":{"tags":[]},"execution_count":13}]},{"cell_type":"code","metadata":{"id":"mD4sg9BAhABj"},"source":[""],"execution_count":null,"outputs":[]}]}